{
  "translation": {
    "navbar1": "Approach",
    "instrumentsTitle": "Instruments",
    "navbar2.5": "Procedure",
    "navbar3": "Result",
    "navbar3.1": "Findings",
    "navbar3.2": "Analysis",
    "tittle1": "What artificial intelligence techniques are being used for cybersecurity in the field of facial authentication?",
    "info1": "What",
    "text1": "Systems Engineering Faculty",
    "text2": "University of Antioquia",
    "text3": "Medellin, Colombia",
    "goals": "Goals",
    "goal1": "Assess the adaptability capacity of threat detection systems based on artificial intelligence, through the analysis and mitigation of potential adversities, such as denial of service attacks or forgeries, to strengthen the effectiveness and reliability of these systems.",
    "goal2": "Analyze the different defense techniques through artificial intelligence applied to cybersecurity.",
    "entities": "Entities",
    "entity1": "Different actors or interest groups related to cybersecurity and the protection of systems and data.",
    "entity2": "Information security professionals, companies, organizations, Internet users, cyber-attackers, software and device developers, among others.",
    "context": "Artificial intelligence has been developing since the last century, and although it was useful for very specific purposes, it was not initially used much in software systems. However, in recent years its use has increased significantly and tends to be implemented for many purposes. The area of cybersecurity is not immune to this, and particularly in the area of different types of user authentication and validation, it has been widely used (Zhu & Al-Qaraghuli, 2022).",
    "contextTitle": "Context",
    "subtitle1": "The elements of the context are identified below:",
    "context1": "Identities: Artificial intelligence, cybersecurity systems, users, companies, software developers, cyber attackers.",
    "context2": "Activities: Authentication, protection, detection, development, attack",
    "context3": "Location: Places where these systems are being used. Usually within the companies that use them for their protection.",
    "context4": "Time: recent period of no more than five years.",
    "context5": "Relationships: There are functional relationships between users and cybersecurity systems and cybersecurity systems and artificial intelligence, since users use cybersecurity systems and they use artificial intelligence to support their ultimate goal.",
    "subtitle2": "There is also a compositional relationship between cyber-attackers and cybersecurity, because if one did not exist, the other would not exist. Companies and cyber-attackers present a relationship of enmity and companies and developers present a labor-type relationship.",
    "definitionTitle": "Definitions",
    "definition1": "Artificial intelligence: Computer program designed to perform certain operations that are considered typical of human intelligence, such as self-learning.",
    "definition2": "Cybersecurity: Cybersecurity is the practice of defending computers, servers, mobile devices, electronic systems, networks, and data from malicious attack.",
    "definition3": "Facial authentication: is a way to identify or confirm the identity of a person through their face",
    "definition4": "Users: Person who habitually uses a service.",
    "definition5": "Companies: A company is a productive unit grouped together and dedicated to developing a profit-oriented economic activity.",
    "definition6": "Software developers: A software developer is in charge of creating the resources that allow the operating system of a computer to manage the programs and applications with which the user performs different tasks.",
    "definition7": "Cyber attackers: Cyber attackers are individuals or groups that use computer technologies and techniques to perform malicious actions online.",
    "needTitle": "Need",
    "need1": "Ontological necessity: To have and to be.",
    "need2": "Axiological need: Protection.",
    "subtitle3": "There is a need to have protection, and be protected, against any type of threat or fraud regarding the privacy of our information.",
    "support_needTitle": "Support need",
    "subtitle4": "Research in artificial intelligence applied to cybersecurity and facial authentication is crucial today, since technology advances by leaps and bounds and security risks too.",
    "subtitle5": "With the increasing amount of data and computer systems, it has become essential to have adequate measures in place to protect sensitive data from cyber threats. The implementation of AI in the evaluation of information security risks is a key issue for the development of any business, since it allows predicting possible security risks and taking preventive measures before they occur. In addition, AI is also used in accurate authentication through facial recognition, including alterations to the face with objects such as masks, hairstyles, hats, and glasses regardless of color.",
    "subtitle6": "However, cybercriminals have also been found to be using AI to create fake faces and other types of images for malicious purposes3. Therefore, it is important to research and develop AI in an ethical and responsible manner to avoid security risks and privacy violations. It is important to note that, although these techniques are very useful for cybersecurity, they can also be used for malicious purposes, such as espionage or mass surveillance.",
    "subtitle7": "The use of AI in cybersecurity is a very important topic, since it is a very useful tool for the protection of information and systems, but it can also be used for malicious purposes, such as espionage or mass surveillance.",
    "problemTitle": "Problem",
    "subtitle8": "Although in modern times there are methods and techniques to satisfy the need to have protection or be protected against cyber attacks (Zhu & Al-Qaraghuli, 2022), these are constantly being modernized (Chaudhuri, 2023), which leads to a problem of finding newer forms of protection in cybersecurity, using current tools, which in this case is artificial intelligence.",
    "referencesTitle": "References",
    "references1": "What is cybersecurity? (2023, 19 abril). latam.kaspersky.com.",
    "referenceLink1": " https://latam.kaspersky.com/resource-center/definitions/what-is-cyber-security",
    "references2": "Facial recognition: definition and explanation. (2023, 19 abril). latam.kaspersky.com.",
    "referenceLink2": "https://latam.kaspersky.com/resource-center/definitions/what-is-facial-recognition",
    "references3": "Indeed Editorial Team. (2023). What is a software developer, what does he do and how to be one? Indeed Professional Guide.",
    "referenceLink3": "https://mx.indeed.com/orientacion-profesional/como-encontrar-empleo/que-hace-un-desarrollador-de-software#:~:text=Un%20desarrollador%20de%20software%20es,el%20usuario%20realiza%20distintas%20tareas.",
    "references4": "Zhu, G., & Al-Qaraghuli, Y. (2022). AI-Assisted Authentication: State of the Art, Taxonomy and Future  Roadmap. arXiv (Cornell University).",
    "referenceLink4": "https://doi.org/10.48550/arxiv.2204.12492",
    "references5": "Chaudhuri, A. (2023). Phishing Attacks Review. ResearchGate.",
    "referenceLink5": "https://www.researchgate.net/publication/368591903_Phishing_Attacks_Review",
    "membersTitle": "Members",
    "instruments": "Within the mentioned techniques, different instruments and tools can be used to carry out the analysis of literature review, statistical analysis and qualitative analysis.",
    "intruments1": "Literature review",
    "instruments1-1": "Academic and scientific databases such as IEEE Xplore, ACM Digital Library, PubMed, Scopus, among others, to search and access relevant scientific and technical articles.",
    "instruments1-2": "Scholarly search engines such as Google Scholar to find scholarly articles, white papers, and other related materials.",
    "instruments1-3": "Bibliographic management tools such as Zotero, Mendeley or EndNote, which allow you to organize and manage bibliographic references efficiently.",
    "intruments2": "Statistic analysis",
    "instruments2-1": "Spreadsheets such as Microsoft Excel or Google Sheets, which have built-in functions to perform basic statistical analysis and generate charts.",
    "instruments2-2": "Statistical software such as SPSS (Statistical Package for the Social Sciences) or R, which provide a wide range of statistical techniques and tools for quantitative data analysis.",
    "intruments3": "Qualitative analysis",
    "instruments3-1": "Qualitative analysis software such as NVivo, ATLAS.ti or MAXQDA, which allow you to organize, analyze and visualize qualitative data, such as interview transcripts or textual documents.",
    "instruments3-2": "Coding matrices, which are tables that help categorize and classify qualitative data, making it possible to identify patterns and emerging themes.",
    "instruments3-3": "Data visualization tools, such as tree diagrams, concept maps, or flowcharts, that help to visually represent the relationships between qualitative data.",
    "membersTitle": "Members",
    "methodTitle": "Methods used",
    "method1": "Surveys: Surveys can be designed and administered to real users who use facial authentication systems in cybersecurity applications. Surveys may include questions on perception of security, ease of use, acceptability, and user satisfaction. This would provide quantitative data to assess the effectiveness and acceptance of facial authentication.",
    "method2": "Interviews: Interviews can be conducted with experts in the field of cybersecurity and facial authentication. This would provide qualitative data on the current state of the art, challenges, and future directions.",
    "method3": "Case Studies: Case studies can be conducted in specific settings, such as organizations that implement facial authentication in their security systems. This would allow the practical results, benefits and limitations of the technology to be examined in a real context.",
    "method4": "Data analysis: Data collected from users, such as performance metrics, security incidents, and other relevant indicators, can be analyzed using statistical techniques. This would allow evaluating the effectiveness of facial authentication in fraud detection and privacy protection.",
    "membersTitle": "Members",
    "techniques": "Techniques",
    "technique1": "Literature review: Documents, reports and other relevant materials related to facial authentication techniques in cybersecurity were analyzed.",
    "technique2": "Qualitative analysis: For the qualitative data obtained through interviews, a thematic analysis was carried out. This to identify emerging patterns and categories in the data to understand the pragmatic, ethical and social aspects of facial authentication.",
    "methodologyTitle": "Methodology",
    "methodology1": "Analysis of material aspects: The materialist approach considers the technical and physical components of facial authentication. This involves investigating the algorithms used, facial recognition systems, image capture devices, and any other related material components. The accuracy and reliability of the facial authentication system can be examined, as well as possible vulnerabilities or technical limitations.",
    "methodology2": "Evaluation of the pragmatic aspects: The pragmatic approach focuses on the practical aspects and the user experience. In a research on facial authentication, this would involve investigating the usability of the system, the ease of use and the acceptability by the users. Factors such as response time, user experience, accessibility, and technical challenges associated with facial authentication can be analyzed. It is also important to consider the privacy and security implications for users, as well as their perception of risk and trust in the technology.",
    "methodology3": "Consideration of ethical and social aspects: The materialist-pragmatic approach also involves an evaluation of the ethical and social aspects of facial authentication in cybersecurity. This involves examining the ethical implications of biometric data collection and storage, potential discrimination, algorithmic bias, and user privacy. Existing privacy policies and regulatory frameworks can be analyzed, as well as considering the social impacts and equity in the implementation of facial authentication.",
    "methodologyItem1": "The materialist-pragmatic knowledge model focuses on understanding the relationship between technology, society, and users, and how material and pragmatic aspects influence the implementation and adoption of a specific technology. In the context of a research on cybersecurity in facial authentication, the materialist-pragmatic approach would be applied as follows:",
    "methodologyItem2": "By combining these three aspects (material, pragmatic, and ethical/social), the materialist-pragmatic knowledge model provides a comprehensive perspective for understanding facial authentication in cybersecurity. This involves not only evaluating the technology itself, but also considering how it interacts with society, users, and the contexts in which it is deployed. Additionally, this approach helps to identify challenges and opportunities in terms of technology improvement, policy design, and ensuring responsible and ethical implementation.",
    "findings1": "Convolutional Neural Networks (CNNs): CNNs are widely used for facial authentication. These networks are capable of learning and recognizing unique facial features, such as the shape of the eyes, nose, and mouth, enabling accurate and robust authentication.",
    "findings2": "Deep Learning: Deep learning is an artificial intelligence technique that uses deep neural networks to process and analyze large data sets. It is applied to the analysis of facial images to identify relevant patterns and features that help verify the authenticity of a person.",
    "findings3": "Liveness detection: This technique is used to detect whether the presented facial image is of a real person or just a static image or reproduction. It uses artificial intelligence algorithms to analyze movement and dynamics in the facial image, such as blinking, lip movement, or subtle skin changes.",
    "findings4": "Transfer learning: Transfer learning is a machine learning technique that involves transferring knowledge from one domain to another. This technique is used in facial authentication to transfer knowledge from a database of facial images to an authentication system.",
    "findings5": "Reinforcement Learning: Reinforcement learning is a subfield of machine learning that is based on the concept of reward. This technique is used in facial authentication to reward the system when authenticating successfully and penalize it when it fails.",
    "findingsTitle": "Findings",
    "findingsItem1": "These are just some of the artificial intelligence techniques used in the field of facial authentication in cybersecurity. Research and development in this field is constantly evolving, so new techniques may appear in the future.",
    "procedure": "Procedure",
    "procedure1": "Bibliographic review: We carried out an exhaustive review of the existing scientific and technical literature on the subject. This involves searching for and analyzing previous and recent research addressing the use of artificial intelligence in facial recognition for security. Specialized magazines, conferences and other resources were used to collect the relevant information.",
    "procedure2": "Analysis of existing research: Once the information was collected, the results of previous research were analyzed and synthesized. The most common techniques and approaches used in facial recognition security were identified.",
    "procedure3": "Identification of techniques and approaches: Based on the analysis of previous research, the most promising techniques and approaches in the field of facial recognition security were identified.",
    "procedure4": "Benchmarking: Once the relevant techniques and approaches were identified, they were compared and evaluated in terms of their effectiveness, accuracy, and robustness in improving facial recognition security.",
    "procedure5": "Identification of challenges and limitations: The challenges and limitations associated with the techniques and approaches studied were also identified. This includes ethical issues, privacy, scalability, sensitivity to lighting and pose variations, adversarial attacks, among others."
  }
}
