{
  "translation": {
    "navbar1": "Planteamiento",
    "intrumentsTitle": "Instrumentos",
    "navbar3": "Resultados",
    "tittle1": "¿Cuáles técnicas de inteligencia artificial se están usando para la ciberseguridad en el ámbito de la autenticación facial?",
    "info1": "¿Cuáles ",
    "text1": "Facultad Ingeniería de sistemas",
    "text2": "Universidad de Antioquia",
    "text3": "Medellín, Colombia",
    "goals": "Objetivos",
    "goal1": "Evaluar la capacidad de adaptación de los sistemas de detección de amenazas basados en inteligencia artificial, mediante el análisis y la mitigación de posibles adversidades, como ataques de denegación de servicio, o falsificaciones, para fortalecer la efectividad y la confiabilidad de estos sistemas.",
    "goal2": "Analizar las distintas técnicas de defensa mediante la inteligencia artificial aplicada a la ciberseguridad.",
    "entities": "Entes",
    "entity1": "Diferentes actores o grupos de interés relacionados con la ciberseguridad y la protección de sistemas y datos.",
    "entity2": "Profesionales de la seguridad informática, empresas, organizaciones, usuarios de internet, ciber-atacantes, desarrolladores de software y dispositivos, entre otros.",
    "context": "La inteligencia artificial se ha ido desarrollando desde el siglo pasado y aunque era util para algunos fines muy concretos, no se usaba mucho en un principio en sistemas de software. Sin embargo en los años recientes su uso ha sido cada vez mayor y tiende a implementarse para muchos fines. El area de la ciberseguridad no es ajeno a esto y particularmente en el area de los diferentes tipos de autenticación y validación de usuarios ha sido ampliamente usada (Zhu & Al-Qaraghuli, 2022)",
    "contextTitle": "Contexto",
    "subtitle1": "A continuación se identifican los elementos del contexto:",
    "context1": "Identidades: Inteligencia artificial, sistemas de ciberseguridad, usuarios, empresas, desarrolladores de software, ciber atacantes.",
    "context2": "Actividades: Autenticación, protección, detección, desarrollo, ataque",
    "context3": "Ubicacion: Lugares donde se está usan estos sistemas. Usualmente dentro de las compañias que los usan para su proteccion.",
    "context4": "Tiempo: periodo reciente no mayor a cinco años.",
    "context5": "Relaciones: Hay relaciones funcionales entre los usuarios y los sistemas de ciberseguridad y los sistemas de ciberseguridad e inteligencia artificial, dado que los usuarios usan los sistemas de ciberseguridad y estos usan la inteligencia artificial como apoyo para su fin ultimo.",
    "subtitle2": "Se encuentra tambien una relacion composicional entre los ciber-atacantes y la ciberseguridad pues si no existiera uno no existiría el otro.​ Las empresas y los ciber atacantes presentan una relacion de enemistad y las empresas y los desarrolladores presentan una relacion de tipo laboral.",
    "definitionTitle": "Definiciones",
    "definition1": "Inteligencia artificial: Programa de computación diseñado para realizar determinadas operaciones que se consideran propias de la inteligencia humana, como el autoaprendizaje.",
    "definition2": "Ciberseguridad: La ciberseguridad es la práctica de defender las computadoras, los servidores, los dispositivos móviles, los sistemas electrónicos, las redes y los datos de ataques maliciosos.",
    "definition3": "Autenticación facial: es una manera de identificar o confirmar la identidad de una persona mediante su rostro.",
    "definition4": "Usuarios: Persona que usa habitualmente un servicio.",
    "definition5": "Empresas: Una empresa es una unidad productiva agrupada y dedicada a desarrollar una actividad económica con ánimo de lucro.",
    "definition6": "Desarrolladores de software: Un desarrollador de software es el encargado de crear los recursos que permiten al sistema operativo de una computadora manejar los programas y las aplicaciones con las cuales el usuario realiza distintas tareas",
    "definition7": "Ciber atacantes:Los ciberatacantes son personas o grupos que utilizan tecnologías y técnicas informáticas para realizar acciones maliciosas en línea.",
    "needTitle": "Necesidad",
    "need1": "Necesidad ontológica: Tener y Estar.",
    "need2": "Necesidad axiológica: Protección.",
    "subtitle3": "Existe la necesidad de tener protección, y estar protegido, contra cualquier tipo de amenaza o fraude en cuanto a la privacidad de nuestra información.",
    "support_needTitle": "Sustentación de necesidad",
    "subtitle4": "La investigación en inteligencia artificial aplicada a la ciberseguridad y autenticación facial es crucial en la actualidad, ya que la tecnología avanza a pasos agigantados y los riesgos de seguridad también.",
    "subtitle5": "Con la creciente cantidad de datos y sistemas informáticos, se ha vuelto fundamental contar con medidas adecuadas para proteger de las amenazas cibernéticas a aquellos que sean confidenciales. La implementación de la IA en la evaluación de riesgos de seguridad de la información es un tema clave para el desarrollo de cualquier negocio, ya que permite predecir posibles riesgos de seguridad y tomar medidas preventivas antes de que ocurran. Además, la IA también se utiliza en la autenticación precisa a través del reconocimiento facial, incluso con alteraciones en el rostro con objetos como máscaras, peinados, sombreros y anteojos sin importar el color.",
    "subtitle6": "Sin embargo, también se ha detectado que los ciberdelincuentes están utilizando la IA para crear rostros ficticios y otros tipos de imágenes con fines maliciosos3. Por ello, es importante investigar y desarrollar la IA de manera ética y responsable para evitar riesgos de seguridad y violaciones de la privacidad. Es importante destacar que, aunque estas técnicas son muy útiles para la ciberseguridad, también pueden ser utilizadas con fines malintencionados, como el espionaje o la vigilancia masiva.",
    "subtitle7": "En cuanto a las técnicas de inteligencia artificial que se están utilizando para la ciberseguridad en el ámbito de la autenticación facial, se destacan el aprendizaje profundo (deep learning) y el reconocimiento facial. El aprendizaje profundo permite a los sistemas de seguridad aprender y mejorar a medida que se exponen a más datos, lo que los hace más precisos y efectivos. Por otro lado, el reconocimiento facial se utiliza para identificar a las personas a través de sus rasgos faciales únicos, lo que permite una autenticación más segura y eficiente.",
    "problemTitle": "Problema",
    "subtitle8": "Si bien en la modernidad hay métodos y técnicas para satisfacer la necesidad de tener protección o estar protegido en contra de ataques cibernéticos (Zhu & Al-Qaraghuli, 2022),  estos constantemente se van modernizando (Chaudhuri, 2023), lo que lleva a un problema de  búsqueda de formas más novedosas de protección en ciberseguridad, usando herramientas de la actualidad, lo que en este caso es la inteligencia artificial.",
    "referencesTitle": "Referencias",
    "references1": "¿Qué es la ciberseguridad? (2023, 19 abril). latam.kaspersky.com.",
    "referenceLink1": " https://latam.kaspersky.com/resource-center/definitions/what-is-cyber-security",
    "references2": "Reconocimiento facial: definición y explicación. (2023, 19 abril). latam.kaspersky.com.",
    "referenceLink2": "https://latam.kaspersky.com/resource-center/definitions/what-is-facial-recognition",
    "references3": "Equipo editorial de Indeed. (2023). ¿Qué es un desarrollador de software, qué hace y cómo serlo? Guía profesional de Indeed.",
    "referenceLink3": "https://mx.indeed.com/orientacion-profesional/como-encontrar-empleo/que-hace-un-desarrollador-de-software#:~:text=Un%20desarrollador%20de%20software%20es,el%20usuario%20realiza%20distintas%20tareas.",
    "references4": "Zhu, G., & Al-Qaraghuli, Y. (2022). AI-Assisted Authentication: State of the Art, Taxonomy and Future  Roadmap. arXiv (Cornell University).",
    "referenceLink4": "https://doi.org/10.48550/arxiv.2204.12492",
    "references5": "Chaudhuri, A. (2023). Phishing Attacks Review. ResearchGate",
    "referenceLink5": "https://www.researchgate.net/publication/368591903_Phishing_Attacks_Review",
    "membersTitle" : "Integrantes",
    "instruments": "Dentro de las técnicas mencionadas, se pueden utilizar diferentes instrumentos y herramientas para llevar a cabo el análisis de la revisión de literatura, el análisis estadístico y el análisis cualitativo.",
    "intruments1": "Revisión de literatura",
    "instruments1-1": "Bases de datos académicas y científicas como IEEE Xplore, ACM Digital Library, PubMed, Scopus, entre otras, para buscar y acceder a artículos científicos y técnicos relevantes.",
    "instruments1-2": "Motores de búsqueda académicos como Google Scholar para encontrar artículos académicos, informes técnicos y otros materiales relacionados.",
    "instruments1-3": "Herramientas de gestión bibliográfica como Zotero, Mendeley o EndNote, que permiten organizar y administrar las referencias bibliográficas de manera eficiente.",
    "intruments2": "Análisis estadístico",
    "instruments2-1": "Hojas de cálculo como Microsoft Excel o Google Sheets, que tienen funciones integradas para realizar análisis estadísticos básicos y generar gráficos.",
    "instruments2-2": "Software estadístico como SPSS (Statistical Package for the Social Sciences) o R, que proporcionan una amplia gama de técnicas estadísticas y herramientas para el análisis de datos cuantitativos.",
    "intruments3": "Análisis cualitativo",
    "instruments3-1": "Software de análisis cualitativo como NVivo, ATLAS.ti o MAXQDA, que permiten organizar, analizar y visualizar datos cualitativos, como transcripciones de entrevistas o documentos textuales.",
    "instruments3-2": "Matrices de codificación, que son tablas que ayudan a categorizar y clasificar los datos cualitativos, permitiendo identificar patrones y temas emergentes.",
    "instruments3-3": "Herramientas de visualización de datos, como diagramas de árbol, mapas conceptuales o diagramas de flujo, que ayudan a representar visualmente las relaciones entre los datos cualitativos.",
    "methodTitle": "Metodos utilizados",
    "method1": "Encuestas: Se pueden diseñar y administrar encuestas a usuarios reales que utilizan sistemas de autenticación facial en aplicaciones de ciberseguridad. Las encuestas pueden incluir preguntas sobre la percepción de seguridad, la facilidad de uso, la aceptabilidad y la satisfacción del usuario. Esto proporcionaría datos cuantitativos para evaluar la efectividad y la aceptación de la autenticación facial.",
    "method2": "Entrevistas: Las entrevistas individuales o grupales con usuarios y expertos en ciberseguridad pueden proporcionar una comprensión más profunda de los aspectos pragmáticos y las consideraciones éticas de la autenticación facial. Estas entrevistas pueden explorar las experiencias de los usuarios, los desafíos percibidos, las preocupaciones de privacidad y las recomendaciones para mejorar la tecnología.",
    "method3": "Estudios de casos: Se pueden realizar estudios de casos en entornos específicos, como organizaciones que implementan la autenticación facial en sus sistemas de seguridad. Esto permitiría examinar los resultados prácticos, los beneficios y las limitaciones de la tecnología en un contexto real.",
    "method4": "Análisis de datos: Los datos recopilados de los usuarios, como métricas de rendimiento, incidentes de seguridad y otros indicadores relevantes, se pueden analizar utilizando técnicas estadísticas. Esto permitiría evaluar la efectividad de la autenticación facial en la detección de fraudes y la protección de la privacidad.",
    "membersTitle": "Integrantes",
    "techniques": "Técnicas",
    "technique1": "Revisión de la literatura: Se analizaron documentos, informes y otros materiales relevantes relacionados con las técnicas de autenticación facial en la ciberseguridad. ",
    "technique2": "Análisis cualitativo: Para los datos cualitativos obtenidos a través de entrevistas se hizo un análisis temático. Esto para identificar patrones y categorías emergentes en los datos para comprender los aspectos pragmáticos, éticos y sociales de la autenticación facial.",
    "methodologyTitle": "Metodología",
    "methodology1": "Análisis de los aspectos materiales: El enfoque materialista considera los componentes técnicos y físicos de la autenticación facial. Esto implica investigar los algoritmos utilizados, los sistemas de reconocimiento facial, los dispositivos de captura de imágenes y cualquier otro componente material relacionado. Se puede examinar la precisión y confiabilidad del sistema de autenticación facial, así como las posibles vulnerabilidades o limitaciones técnicas. ",
    "methodology2": "Evaluación de los aspectos pragmáticos: El enfoque pragmático se centra en los aspectos prácticos y la experiencia del usuario. En una investigación sobre autenticación facial, esto implicaría investigar la usabilidad del sistema, la facilidad de uso y la aceptabilidad por parte de los usuarios. Se pueden analizar factores como el tiempo de respuesta, la experiencia del usuario, la accesibilidad y los desafíos técnicos asociados con la autenticación facial. También es importante considerar las implicaciones de privacidad y seguridad para los usuarios, así como su percepción de riesgo y confianza en la tecnología.",
    "methodology3": "Consideración de los aspectos éticos y sociales: El enfoque materialista-pragmático también involucra una evaluación de los aspectos éticos y sociales de la autenticación facial en la ciberseguridad. Esto implica examinar las implicaciones éticas de la recopilación y almacenamiento de datos biométricos, la discriminación potencial, el sesgo algorítmico y la privacidad del usuario. Se pueden analizar las políticas de privacidad y los marcos regulatorios existentes, así como considerar los impactos sociales y la equidad en la implementación de la autenticación facial.",
    "methodologyItem1": "El modelo de conocimiento materialista-pragmático se enfoca en comprender la relación entre la tecnología, la sociedad y los usuarios, y cómo los aspectos materiales y pragmáticos influyen en la implementación y adopción de una tecnología específica. En el contexto de una investigación sobre ciberseguridad en la autenticación facial, el enfoque materialista-pragmático se aplicaría de la siguiente manera: ",
    "methodologyItem2": "Al combinar estos tres aspectos (materiales, pragmáticos y éticos/sociales), el modelo de conocimiento materialista-pragmático proporciona una perspectiva integral para comprender la autenticación facial en el ámbito de la ciberseguridad. Esto implica no solo evaluar la tecnología en sí misma, sino también considerar cómo interactúa con la sociedad, los usuarios y los contextos en los que se implementa. Además, este enfoque ayuda a identificar desafíos y oportunidades en términos de mejora de la tecnología, diseño de políticas y garantía de una implementación ética y responsable."
  }
}
